{
  "changelog-coverage": "Every substantive change must be recorded in the changelog entry for the\ncurrent version. This policy prevents untracked updates and keeps release\nnotes aligned with repository changes.",
  "devcov-self-enforcement": "DevCovenant must keep its registry synchronized with policy definitions.",
  "devcov-structure-guard": "Ensure the DevCovenant repo keeps the required structure and tooling files.",
  "devflow-run-gates": "DevCovenant must record and enforce the standard workflow: pre-commit start,\ntests, then pre-commit end. The policy reads the status file to ensure each\ngate ran and that no required command was skipped.\nThis check is enforced for every repository change (including\ndocumentation-only updates) so the gate sequence cannot be skipped.",
  "docstring-and-comment-coverage": "Python modules, classes, and functions must include a docstring or a nearby\nexplanatory comment. This keeps intent visible even as code evolves.",
  "documentation-growth-tracking": "When user-facing files change (as defined by the user-facing selectors and\nkeywords), the documentation set listed here must be updated. User-facing\nincludes API surfaces, integration touchpoints, and any behavior that affects\nthe user's experience or workflow. Updated docs should mention the relevant\ncomponents by name so readers can find changes quickly. The policy also\nenforces documentation quality standards such as required headings, a table\nof contents, and minimum depth.",
  "last-updated-placement": "Docs must include a `Last Updated` header near the top so readers can trust\nrecency. The auto-fix keeps timestamps current while respecting allowed\nlocations.",
  "line-length-limit": "Keep lines within the configured maximum so documentation and code remain\nreadable. Reflow long sentences or wrap lists rather than ignoring the limit.",
  "name-clarity": "Identifiers should be descriptive enough to communicate intent without\nreading their implementation. Avoid cryptic or overly short names unless\nexplicitly justified.",
  "new-modules-need-tests": "New or modified modules in the watched locations must have corresponding\ntests. Test modules (files starting with `test_`) are exempt from the rule.",
  "no-future-dates": "Dates in changelogs or documentation must not be in the future. Auto-fixers\nshould correct accidental placeholders to today’s date.",
  "policy-text-presence": "Every policy definition must include descriptive text immediately after the\n`policy-def` block. Empty policy descriptions are not allowed.",
  "read-only-directories": "Protect declared read-only directories from modification. If a directory must\nbe editable, update this policy definition first.",
  "security-scanner": "Scan Python files for risky constructs like `eval`, `exec`, or `shell=True`.\nUse the documented allow-comment only when a security review approves the\nexception.",
  "stock-policy-text-sync": "If a built-in policy text is edited from its stock wording, DevCovenant must\nraise a warning and instruct the agent to either restore the stock text or\npatch the policy implementation to match the new meaning.",
  "version-sync": "All version-bearing files must match the canonical `VERSION` value, and\nversion bumps must move forward. The policy also flags hard-coded runtime\nversions and ensures changelog releases reflect the current version."
}
